Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: Instead of the C<layout> helper you could also just use the C<layout> stash value, or call L<Mojolicious::Controller/"render"> with the C<layout> argument.
ja: Instead of the C<layout> helper you could also just use the C<layout> stash value, or call [[Mojolicious::Controller/"render"]] with the C<layout> argument.

source: Instead of the L</"plugin"> function you just use the method L<Mojolicious/"plugin">.
ja: Instead of the [[/"plugin"]] function you just use the method [[Mojolicious/"plugin"]].

source: Internally, the L<Mojo::IOLoop> event loop can use multiple reactor backends, L<EV> for example, will be automatically used if possible.
ja: Internally, the [[Mojo::IOLoop]] event loop can use multiple reactor backends, [[EV]] for example, will be automatically used if possible.

source: It can also help your exposure within the community and will make it easier to attract L<Mojolicious> developers.
ja: It can also help your exposure within the community and will make it easier to attract [[Mojolicious]] developers.

source: It defaults to C<20> seconds for the user agent and C<15> seconds for all built-in web servers, and can be changed with the attributes L<Mojo::UserAgent/"inactivity_timeout"> and L<Mojo::Server::Daemon/"inactivity_timeout"> or the C<MOJO_INACTIVITY_TIMEOUT> environment variable.
ja: It defaults to C<20> seconds for the user agent and C<15> seconds for all built-in web servers, and can be changed with the attributes [[Mojo::UserAgent/"inactivity_timeout"]] and [[Mojo::Server::Daemon/"inactivity_timeout"]] or the C<MOJO_INACTIVITY_TIMEOUT> environment variable.

source: It defaults to using L<Mojolicious/"moniker">, which is not very secure, so we added this log message as a reminder.
ja: It defaults to using [[Mojolicious/"moniker"]], which is not very secure, so we added this log message as a reminder.

source: It is also the default controller class unless you set L<Mojolicious/"controller_class">.
ja: It is also the default controller class unless you set [[Mojolicious/"controller_class"]].

source: It is available to every application through the command L<Mojolicious::Command::daemon>, which has many configuration options and is known to work on every platform Perl works on with its single-process architecture.
ja: It is available to every application through the command [[Mojolicious::Command::daemon]], which has many configuration options and is known to work on every platform Perl works on with its single-process architecture.

source: It is based on L<Mojo::Template> and allows the embedding of Perl code right into actual content using a small set of special tags and line start characters.
ja: It is based on [[Mojo::Template]] and allows the embedding of Perl code right into actual content using a small set of special tags and line start characters.

source: It is based on the L<Mojo::Server::Prefork> web server, which adds pre-forking to L<Mojo::Server::Daemon>, but optimized specifically for production environments out of the box.
ja: It is based on the [[Mojo::Server::Prefork]] web server, which adds pre-forking to [[Mojo::Server::Daemon]], but optimized specifically for production environments out of the box.

source: It is basically a restarter that forks a new L<Mojo::Server::Daemon> web server whenever a file in your project changes, and should therefore only be used during development.
ja: It is basically a restarter that forks a new [[Mojo::Server::Daemon]] web server whenever a file in your project changes, and should therefore only be used during development.

source: It is highly encouraged that readers continue on to the remaining guides after reading this one.
ja: これを読み終わった後は、残りのガイドを読むことををおすすめします。

source: JSON is the most commonly used data-interchange format for web services.
ja: JSONは、ウェブサービスでもっともよく使われるデータ交換フォーマットです。

source: Just a few small details change, instead of L<lib> we now use L<FindBin> and C<@INC>, allowing us to start the application from outside its home directory.
ja: Just a few small details change, instead of [[lib]] we now use [[FindBin]] and C<@INC>, allowing us to start the application from outside its home directory.

source: Just be aware that all session data gets serialized with L<Mojo::JSON> and stored client-side, with a cryptographic signature to prevent tampering.
ja: すべてのセッションデータは[[Mojo::JSON]]でシリアライズされ、 クライアントサイドに保存されることを意識しておいてください。改ざんを防ぐために、暗号化された署名がついています。

source: Just make sure not to use C<^> and C<$>, or capturing groups C<(...)>, non-capturing groups C<(?:...)> are fine though.
ja: C<^>とC<$>を使ったり、C<(...)>でグループのキャプチャは行わないでください。けれどもキャプチャしないC<(?:...)>は大丈夫です。

source: Just receive messages by subscribing to events such as L<Mojo::Transaction::WebSocket/"json"> with L<Mojolicious::Controller/"on"> and return them with L<Mojolicious::Controller/"send">.
ja: [[Mojo::Transaction::WebSocket]]のC<json>と同じイベントを、[[Mojolicious::Controller]]のC<on>を使って購読することによってメッセージを受信できます。メッセージを送信するには [[Mojolicious::Controller]]のC<send>を使います。

source: Just remember that all session data gets serialized with L<Mojo::JSON> and stored in HMAC-SHA1 signed cookies, which usually have a C<4096> byte (4KiB) limit, depending on browser.
ja: Just remember that all session data gets serialized with [[Mojo::JSON]] and stored in HMAC-SHA1 signed cookies, which usually have a C<4096> byte (4KiB) limit, depending on browser.

source: Just run your tests with L<prove>.
ja: Just run your tests with [[prove]].

source: Just use the helper L<Mojolicious::Plugin::DefaultHelpers/"include"> to include one template into another.
ja: Just use the helper [[Mojolicious::Plugin::DefaultHelpers/"include"]] to include one template into another.

source: L<<%= $class %>> inherits all methods from L<Mojolicious::Plugin> and implements the following new ones.
ja: [[<%= $class %]]]] inherits all methods from [[Mojolicious::Plugin]] and implements the following new ones.

source: L<<%= $class %>> is a L<Mojolicious> plugin.
ja: [[<%= $class %>]] is a [[Mojolicious]] plugin.

source: L<Hypnotoad|Mojo::Server::Hypnotoad> makes zero downtime software upgrades (hot deployment) very simple, as you can see above, but on modern operating systems that support the C<SO_REUSEPORT> socket option, there is also another method available that works with all built-in web servers.
ja: [[Hypnotoad|Mojo::Server::Hypnotoad]] makes zero downtime software upgrades (hot deployment) very simple, as you can see above, but on modern operating systems that support the C<SO_REUSEPORT> socket option, there is also another method available that works with all built-in web servers.

source: L<Mojo::Asset::File> inherits all attributes from L<Mojo::Asset> and implements the following new ones.
ja: [[Mojo::Asset::File]] inherits all attributes from [[Mojo::Asset]] and implements the following new ones.

source: L<Mojo::Asset::File> inherits all events from L<Mojo::Asset>.
ja: [[Mojo::Asset::File]] inherits all events from [[Mojo::Asset]].

source: L<Mojo::Asset::File> inherits all methods from L<Mojo::Asset> and implements the following new ones.
ja: [[Mojo::Asset::File]] inherits all methods from [[Mojo::Asset]] and implements the following new ones.

source: L<Mojo::Asset::File> is a file storage backend for HTTP content.
ja: [[Mojo::Asset::File]] is a file storage backend for HTTP content.

source: L<Mojo::Asset::Memory> inherits all attributes from L<Mojo::Asset> and implements the following new ones.
ja: [[Mojo::Asset::Memory]] inherits all attributes from [[Mojo::Asset]] and implements the following new ones.

source: L<Mojo::Asset::Memory> inherits all events from L<Mojo::Asset> and can emit the following new ones.
ja: [[Mojo::Asset::Memory]] inherits all events from [[Mojo::Asset]] and can emit the following new ones.

source: L<Mojo::Asset::Memory> inherits all methods from L<Mojo::Asset> and implements the following new ones.
ja: [[Mojo::Asset::Memory]] inherits all methods from [[Mojo::Asset]] and implements the following new ones.

source: L<Mojo::Asset::Memory> is an in-memory storage backend for HTTP content.
ja: [[Mojo::Asset::Memory]] is an in-memory storage backend for HTTP content.

source: L<Mojo::Asset> implements the following attributes.
ja: [[Mojo::Asset]] implements the following attributes.

source: L<Mojo::Asset> inherits all events from L<Mojo::EventEmitter>.
ja: [[Mojo::Asset]] inherits all events from [[Mojo::EventEmitter]].

source: L<Mojo::Asset> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::Asset]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::Asset> is an abstract base class for HTTP content storage backends, like L<Mojo::Asset::File> and L<Mojo::Asset::Memory>.
ja: [[Mojo::Asset]] is an abstract base class for HTTP content storage backends, like [[Mojo::Asset::File]] and [[Mojo::Asset::Memory]].

source: L<Mojo::Base> implements the following functions, which can be imported with the C<-base> flag or by setting a base class.
ja: [[Mojo::Base]] implements the following functions, which can be imported with the C<-base> flag or by setting a base class.

source: L<Mojo::Base> implements the following methods.
ja: [[Mojo::Base]] implements the following methods.

source: L<Mojo::Base> is a simple base class for L<Mojo> projects with fluent interfaces.
ja: [[Mojo::Base]] is a simple base class for [[Mojo]] projects with fluent interfaces.

source: L<Mojo::Base> will help you with this by having all attribute accessors created with L</"has"> (or L</"attr">) return their invocant (C<$self>) whenever they are used to assign a new attribute value.
ja: [[Mojo::Base]] will help you with this by having all attribute accessors created with [[/"has"]] (or [[/"attr"]]) return their invocant (C<$self>) whenever they are used to assign a new attribute value.

source: L<Mojo::ByteStream> implements the following functions, which can be imported individually.
ja: [[Mojo::ByteStream]] implements the following functions, which can be imported individually.

source: L<Mojo::ByteStream> implements the following methods.
ja: [[Mojo::ByteStream]] implements the following methods.

source: L<Mojo::ByteStream> is a scalar-based container for bytestreams that provides a more friendly API for many of the functions in L<Mojo::Util>.
ja: [[Mojo::ByteStream]] is a scalar-based container for bytestreams that provides a more friendly API for many of the functions in [[Mojo::Util]].

source: L<Mojo::ByteStream> objects are always excluded from automatic escaping.
ja: [[Mojo::ByteStream]] objects are always excluded from automatic escaping.

source: L<Mojo::ByteStream> overloads the following operators.
ja: [[Mojo::ByteStream]] overloads the following operators.

source: L<Mojo::Cache> implements the following attributes.
ja: [[Mojo::Cache]] implements the following attributes.

source: L<Mojo::Cache> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Cache]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Cache> is a naive in-memory cache with size limits.
ja: [[Mojo::Cache]] is a naive in-memory cache with size limits.

source: L<Mojo::Collection> implements the following functions, which can be imported individually.
ja: [[Mojo::Collection]] implements the following functions, which can be imported individually.

source: L<Mojo::Collection> implements the following methods.
ja: [[Mojo::Collection]] implements the following methods.

source: L<Mojo::Collection> is an array-based container for collections.
ja: [[Mojo::Collection]] is an array-based container for collections.

source: L<Mojo::Content::MultiPart> inherits all attributes from L<Mojo::Content> and implements the following new ones.
ja: [[Mojo::Content::MultiPart]] inherits all attributes from [[Mojo::Content]] and implements the following new ones.

source: L<Mojo::Content::MultiPart> inherits all methods from L<Mojo::Content> and implements the following new ones.
ja: [[Mojo::Content::MultiPart]] inherits all methods from [[Mojo::Content]] and implements the following new ones.

source: L<Mojo::Content::MultiPart> is a container for HTTP multipart content, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230>, L<RFC 7231|http://tools.ietf.org/html/rfc7231> and L<RFC 2388|http://tools.ietf.org/html/rfc2388>.
ja: [[Mojo::Content::MultiPart]] is a container for HTTP multipart content, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]], [[RFC 7231|http://tools.ietf.org/html/rfc7231]] and [[RFC 2388|http://tools.ietf.org/html/rfc2388]].

source: L<Mojo::Content::Multipart> inherits all events from L<Mojo::Content> and can emit the following new ones.
ja: [[Mojo::Content::Multipart]] inherits all events from [[Mojo::Content]] and can emit the following new ones.

source: L<Mojo::Content::Single> inherits all attributes from L<Mojo::Content> and implements the following new ones.
ja: [[Mojo::Content::Single]] inherits all attributes from [[Mojo::Content]] and implements the following new ones.

source: L<Mojo::Content::Single> inherits all events from L<Mojo::Content> and can emit the following new ones.
ja: [[Mojo::Content::Single]] inherits all events from [[Mojo::Content]] and can emit the following new ones.

source: L<Mojo::Content::Single> inherits all methods from L<Mojo::Content> and implements the following new ones.
ja: [[Mojo::Content::Single]] inherits all methods from [[Mojo::Content]] and implements the following new ones.

source: L<Mojo::Content::Single> is a container for HTTP content, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230> and L<RFC 7231|http://tools.ietf.org/html/rfc7231>.
ja: [[Mojo::Content::Single]] is a container for HTTP content, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]] and [[RFC 7231|http://tools.ietf.org/html/rfc7231]].

source: L<Mojo::Content> implements the following attributes.
ja: [[Mojo::Content]] implements the following attributes.

source: L<Mojo::Content> inherits all events from L<Mojo::EventEmitter> and can emit the following new ones.
ja: [[Mojo::Content]] inherits all events from [[Mojo::EventEmitter]] and can emit the following new ones.

source: L<Mojo::Content> inherits all methods from L<Mojo::EventEmitter> and implements the following new ones.
ja: [[Mojo::Content]] inherits all methods from [[Mojo::EventEmitter]] and implements the following new ones.

source: L<Mojo::Content> is an abstract base class for HTTP content containers, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230> and L<RFC 7231|http://tools.ietf.org/html/rfc7231>, like L<Mojo::Content::MultiPart> and L<Mojo::Content::Single>.
ja: [[Mojo::Content]] is an abstract base class for HTTP content containers, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]] and [[RFC 7231|http://tools.ietf.org/html/rfc7231]], like [[Mojo::Content::MultiPart]] and [[Mojo::Content::Single]].

source: L<Mojo::Cookie::Request> inherits all attributes from L<Mojo::Cookie>.
ja: [[Mojo::Cookie::Request]] inherits all attributes from [[Mojo::Cookie]].

source: L<Mojo::Cookie::Request> inherits all methods from L<Mojo::Cookie> and implements the following new ones.
ja: [[Mojo::Cookie::Request]] inherits all methods from [[Mojo::Cookie]] and implements the following new ones.

source: L<Mojo::Cookie::Request> is a container for HTTP request cookies, based on L<RFC 6265|http://tools.ietf.org/html/rfc6265>.
ja: [[Mojo::Cookie::Request]] is a container for HTTP request cookies, based on [[RFC 6265|http://tools.ietf.org/html/rfc6265]].

source: L<Mojo::Cookie::Response> inherits all attributes from L<Mojo::Cookie> and implements the following new ones.
ja: [[Mojo::Cookie::Response]] inherits all attributes from [[Mojo::Cookie]] and implements the following new ones.

source: L<Mojo::Cookie::Response> inherits all methods from L<Mojo::Cookie> and implements the following new ones.
ja: [[Mojo::Cookie::Response]] inherits all methods from [[Mojo::Cookie]] and implements the following new ones.

source: L<Mojo::Cookie::Response> is a container for HTTP response cookies, based on L<RFC 6265|http://tools.ietf.org/html/rfc6265>.
ja: [[Mojo::Cookie::Response]] is a container for HTTP response cookies, based on [[RFC 6265|http://tools.ietf.org/html/rfc6265]].

source: L<Mojo::Cookie> implements the following attributes.
ja: [[Mojo::Cookie]] implements the following attributes.

source: L<Mojo::Cookie> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Cookie]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Cookie> is an abstract base class for HTTP cookie containers, based on L<RFC 6265|http://tools.ietf.org/html/rfc6265>, like L<Mojo::Cookie::Request> and L<Mojo::Cookie::Response>.
ja: [[Mojo::Cookie]] is an abstract base class for HTTP cookie containers, based on [[RFC 6265|http://tools.ietf.org/html/rfc6265]], like [[Mojo::Cookie::Request]] and [[Mojo::Cookie::Response]].

source: L<Mojo::Cookie> overloads the following operators.
ja: [[Mojo::Cookie]] overloads the following operators.

source: L<Mojo::DOM::CSS> implements the following attributes.
ja: [[Mojo::DOM::CSS]] implements the following attributes.

source: L<Mojo::DOM::CSS> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::DOM::CSS]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::DOM::CSS> is the CSS selector engine used by L<Mojo::DOM>, based on the L<HTML Living Standard|https://html.spec.whatwg.org> and L<Selectors Level 3|http://www.w3.org/TR/css3-selectors/>.
ja: [[Mojo::DOM::CSS]] is the CSS selector engine used by [[Mojo::DOM]], based on the [[HTML Living Standard|https://html.spec.whatwg.org]] and [[Selectors Level 3|http://www.w3.org/TR/css3-selectors/]].

source: L<Mojo::DOM::HTML> implements the following attributes.
ja: [[Mojo::DOM::HTML]] implements the following attributes.

source: L<Mojo::DOM::HTML> implements the following functions, which can be imported individually.
ja: [[Mojo::DOM::HTML]] implements the following functions, which can be imported individually.

source: L<Mojo::DOM::HTML> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::DOM::HTML]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::DOM::HTML> is the HTML/XML engine used by L<Mojo::DOM>, based on the L<HTML Living Standard|https://html.spec.whatwg.org> and the L<Extensible Markup Language (XML) 1.0|http://www.w3.org/TR/xml/>.
ja: [[Mojo::DOM::HTML]] is the HTML/XML engine used by [[Mojo::DOM]], based on the [[HTML Living Standard|https://html.spec.whatwg.org]] and the [[Extensible Markup Language (XML) 1.0|http://www.w3.org/TR/xml/]].

source: L<Mojo::DOM> defaults to HTML semantics, that means all tags and attribute names are lowercased and selectors need to be lowercase as well.
ja: [[Mojo::DOM]] defaults to HTML semantics, that means all tags and attribute names are lowercased and selectors need to be lowercase as well.

source: L<Mojo::DOM> implements the following methods.
ja: [[Mojo::DOM]] implements the following methods.

source: L<Mojo::DOM> is a minimalistic and relaxed HTML/XML DOM parser with CSS selector support.
ja: [[Mojo::DOM]] is a minimalistic and relaxed HTML/XML DOM parser with CSS selector support.

source: L<Mojo::DOM> overloads the following operators.
ja: [[Mojo::DOM]] overloads the following operators.

source: L<Mojo::Date> implements HTTP date and time functions, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230>, L<RFC 7231|http://tools.ietf.org/html/rfc7231> and L<RFC 3339|http://tools.ietf.org/html/rfc3339>.
ja: [[Mojo::Date]] implements HTTP date and time functions, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]], [[RFC 7231|http://tools.ietf.org/html/rfc7231]] and [[RFC 3339|http://tools.ietf.org/html/rfc3339]].

source: L<Mojo::Date> implements the following attributes.
ja: [[Mojo::Date]] implements the following attributes.

source: L<Mojo::Date> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Date]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Date> overloads the following operators.
ja: [[Mojo::Date]] overloads the following operators.

source: L<Mojo::DynamicMethods> implements the following functions.
ja: [[Mojo::DynamicMethods]] implements the following functions.

source: L<Mojo::DynamicMethods> provides dynamic method dispatch for per-object helper methods without requiring use of C<AUTOLOAD>.
ja: [[Mojo::DynamicMethods]] provides dynamic method dispatch for per-object helper methods without requiring use of C<AUTOLOAD>.

source: L<Mojo::EventEmitter> can emit the following events.
ja: [[Mojo::EventEmitter]] can emit the following events.

source: L<Mojo::EventEmitter> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::EventEmitter]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::EventEmitter> is a simple base class for event emitting objects.
ja: [[Mojo::EventEmitter]] is a simple base class for event emitting objects.

source: L<Mojo::Exception> implements the following attributes.
ja: [[Mojo::Exception]] implements the following attributes.

source: L<Mojo::Exception> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Exception]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Exception> is a container for exceptions with context information.
ja: [[Mojo::Exception]] is a container for exceptions with context information.

source: L<Mojo::Exception> overloads the following operators.
ja: [[Mojo::Exception]] overloads the following operators.

source: L<Mojo::File> implements the following functions, which can be imported individually.
ja: [[Mojo::File]] implements the following functions, which can be imported individually.

source: L<Mojo::File> implements the following methods.
ja: [[Mojo::File]] implements the following methods.

source: L<Mojo::File> is a scalar-based container for file system paths that provides a friendly API for dealing with different operating systems.
ja: [[Mojo::File]] is a scalar-based container for file system paths that provides a friendly API for dealing with different operating systems.

source: L<Mojo::File> overloads the following operators.
ja: [[Mojo::File]] overloads the following operators.

source: L<Mojo::Headers> implements the following attributes.
ja: [[Mojo::Headers]] implements the following attributes.

source: L<Mojo::Headers> inherits all methods from L<Mojo::Base> and implements the following new ones.
ja: [[Mojo::Headers]] inherits all methods from [[Mojo::Base]] and implements the following new ones.

source: L<Mojo::Headers> is a container for HTTP headers, based on L<RFC 7230|http://tools.ietf.org/html/rfc7230> and L<RFC 7231|http://tools.ietf.org/html/rfc7231>.
ja: [[Mojo::Headers]] is a container for HTTP headers, based on [[RFC 7230|http://tools.ietf.org/html/rfc7230]] and [[RFC 7231|http://tools.ietf.org/html/rfc7231]].

source: L<Mojo::HelloWorld> inherits all attributes from L<Mojolicious>.
ja: [[Mojo::HelloWorld]] inherits all attributes from [[Mojolicious]].

source: L<Mojo::HelloWorld> inherits all methods from L<Mojolicious> and implements the following new ones.
ja: [[Mojo::HelloWorld]] inherits all methods from [[Mojolicious]] and implements the following new ones.
